nxp-mcuxpresso/mcuxsdk-examples/_boards/mimxrt700evk/multiprocessor_examples/erpc_server_matrix_multiply_i2c/cm33_core0/pin_mux.c
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: MIMXRT798S
package_id: MIMXRT798SGFOA
mcu_data: ksdk2_0
processor_version: 0.0.0
pin_labels:
- {pin_num: N4, pin_signal: PIO0_31/LP_FLEXCOMM0_P0/UTICK0_CAP2/SCT0_OUT8/CTIMER4_MAT0, label: GPIO_BRIDGE, identifier: GPIO_BRIDGE}
- {pin_num: D2, pin_signal: PIO3_2/LPSPI14_SIN/EZH_PIO18, label: GPIO_HANDSHAKE, identifier: GPIO_HANDSHAKE}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_iopctl.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: R1, peripheral: LP_FLEXCOMM2, signal: P1, pin_signal: PIO1_12/LP_FLEXCOMM2_P1/SCT0_GPIN3/SCT0_OUT9/CTIMER1_MAT1/CLKCTL0_TRACEDATA1, open_drain: enable,
    input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: R2, peripheral: LP_FLEXCOMM2, signal: P0, pin_signal: PIO1_11/LP_FLEXCOMM2_P0/CTIMER2_MAT2/CLKCTL0_TRACEDATA0, open_drain: enable, input_buffer: enable,
    pull_select: up, pull_enable: enable}
  - {pin_num: D2, peripheral: GPIO3, signal: 'GPIO, 2', pin_signal: PIO3_2/LPSPI14_SIN/EZH_PIO18, direction: OUTPUT, gpio_init_state: 'false'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitPins(void)
{
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);

    GPIO3->PCOR = ((GPIO3->PCOR &
                    /* Mask bits to zero which are setting */
                    (~(GPIO_PCOR_PTCO2_MASK)))

                   /* Port Clear Output: Corresponding field in PDOR becomes 0 */
                   | GPIO_PCOR_PTCO2(PCOR_PTCO2_ptco1));

    GPIO3->PDDR = ((GPIO3->PDDR &
                    /* Mask bits to zero which are setting */
                    (~(GPIO_PDDR_PDD2_MASK)))

                   /* Port Data Direction: Output */
                   | GPIO_PDDR_PDD2(PDDR_PDD2_pdd1));

    const uint32_t port1_pin11_config = (/* Pin is configured as LP_FLEXCOMM2_P0 */
                                         IOPCTL_PIO_FUNC1 |
                                         /* Enable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_EN |
                                         /* Enable pull-up function */
                                         IOPCTL_PIO_PULLUP_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Pseudo Output Drain is enabled */
                                         IOPCTL_PIO_PSEDRAIN_EN |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI |
                                         /* Selects transmitter current drive 100ohm */
                                         IOPCTL_PIO_DRIVE_100OHM);
    /* PORT1 PIN11 (coords: R2) is configured as LP_FLEXCOMM2_P0 */
    IOPCTL_PinMuxSet(1U, 11U, port1_pin11_config);

    const uint32_t port1_pin12_config = (/* Pin is configured as LP_FLEXCOMM2_P1 */
                                         IOPCTL_PIO_FUNC1 |
                                         /* Enable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_EN |
                                         /* Enable pull-up function */
                                         IOPCTL_PIO_PULLUP_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Pseudo Output Drain is enabled */
                                         IOPCTL_PIO_PSEDRAIN_EN |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI |
                                         /* Selects transmitter current drive 100ohm */
                                         IOPCTL_PIO_DRIVE_100OHM);
    /* PORT1 PIN12 (coords: R1) is configured as LP_FLEXCOMM2_P1 */
    IOPCTL_PinMuxSet(1U, 12U, port1_pin12_config);

    const uint32_t GPIO_HANDSHAKE = (/* Pin is configured as GPIO3_GPIO2 */
                                     IOPCTL_PIO_FUNC0 |
                                     /* Disable pull-up / pull-down function */
                                     IOPCTL_PIO_PUPD_DI |
                                     /* Enable pull-down function */
                                     IOPCTL_PIO_PULLDOWN_EN |
                                     /* Disable input buffer function */
                                     IOPCTL_PIO_INBUF_DI |
                                     /* Pseudo Output Drain is disabled */
                                     IOPCTL_PIO_PSEDRAIN_DI |
                                     /* Input function is not inverted */
                                     IOPCTL_PIO_INV_DI |
                                     /* Selects transmitter current drive 100ohm */
                                     IOPCTL_PIO_DRIVE_100OHM);
    /* PORT3 PIN2 (coords: D2) is configured as GPIO3_GPIO2 */
    IOPCTL_PinMuxSet(BOARD_INITPINS_GPIO_HANDSHAKE_PORT, BOARD_INITPINS_GPIO_HANDSHAKE_PIN, GPIO_HANDSHAKE);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
